const ILL = 'illustration';
const CARD_BACK = 'Image/card-backside.jpeg';
const COIN = 'Image/coin.png';

const CARD_DB = {
  PIRATE: {
    code:'PIRATE', name:'জলদস্যু', en:'Pirate', rank:9, qty:1,
    img:`${ILL}/pirate.png`,
    text:'যদি আপনি কোনও কারণে জলদস্যু খেলেন অথবা ডিসকার্ড করেন, তাহলে আপনি চলমান রাউন্ড থেকে বাদ পড়বেন।',
  },
  CAPTAIN: {
    code:'CAPTAIN', name:'ক্যাপ্টেন', en:'Captain', rank:8, qty:1,
    img:`${ILL}/captain.png`,
    text:'আপনার হাতে কামান চালক অথবা নাবিক এর মধ্যে কোন একটি কার্ড থাকে, তাহলে আপনার টার্নে আপনার অবশ্যই ক্যাপ্টেন কার্ডটি খেলতে হবে।',
  },
  SAILOR: {
    code:'SAILOR', name:'নাবিক', en:'Sailor', rank:7, qty:1,
    img:`${ILL}/sailor.png`,
    text:'অন্য একজন খেলোয়াড় বেছে নিন এবং সেই খেলোয়াড়ের সাথে হাতের কার্ড বদল করুন।',
  },
  SWORDSMAN: {
    code:'SWORDSMAN', name:'তলোয়ারবাজ', en:'Swordsman', rank:6, qty:2,
    img:`${ILL}/swordsman.png`,
    text:'অন্য একজন খেলোয়াড় বেছে নিন। আপনি আর সেই খেলোয়াড় গোপনে হাতের কার্ড তুলনা করুন। যার কাছে কম মানের কার্ড আছে সে রাউন্ড থেকে বাদ পড়বে। যদি টাই হয়, তাহলে কোনও খেলোয়াড়ই রাউন্ড থেকে বাদ পড়বে না।',
  },
  MERCHANT: {
    code:'MERCHANT', name:'বণিক', en:'Merchant', rank:5, qty:2,
    img:`${ILL}/merchant.png`,
    text:'ডেক থেকে দুটি কার্ড আপনার হাতে নিন। এখন তিনটি কার্ডের মধ্যে একটি বেছে নিন এবং আপনার হাতে রাখুন, এবং অন্য দুটি কার্ড গোপনে ডেকের নীচের দিকে যেকোনো ক্রমে রাখুন।',
  },
  CANNONEER: {
    code:'CANNONEER', name:'কামান চালক', en:'Cannoneer', rank:4, qty:2,
    img:`${ILL}/canoneer.png`,
    text:'যেকোনো খেলোয়াড়কে বেছে নিন (নিজেকেও বেছে নেওয়া যাবে)। সেই খেলোয়াড় তার হাতে থাকা কার্ডটি ডিসকার্ড করবেন এবং ডেক থেকে উপরের কার্ডটি নিবেন।',
  },
  CREW: {
    code:'CREW', name:'জাহাজ কর্মচারী', en:'Ship Crew', rank:3, qty:2,
    img:`${ILL}/crew.png`,
    text:'অন্য একজন খেলোয়াড় বেছে নিন এবং গোপনে তার কার্ড দেখে নিন (অন্য কাউকে না দেখিয়ে)।',
  },
  SPY: {
    code:'SPY', name:'গুপ্তচর', en:'Spy', rank:2, qty:2,
    img:`${ILL}/spy.png`,
    text:'আপনার পরবর্তী টার্ন শুরু না হওয়া পর্যন্ত, অন্যান্য কোন খেলোয়াড়ের কার্ডের প্রভাব আপনার উপর পরবে না।',
  },
  GUARD: {
    code:'GUARD', name:'পাহারাদার', en:'Guard', rank:1, qty:6,
    img:`${ILL}/guard.png`,
    text:'অন্য একজন খেলোয়াড় বেছে নিন এবং পাহারাদার ছাড়া অন্য যেকোনো কার্ডের নাম বলুন। যদি ঐ খেলোয়াড়ের কাছে আপনার ঘোষিত কার্ড থাকে তাহলে ঐ খেলোয়াড় রাউন্ড থেকে বাদ পড়বেন।',
  },
  ROGUE: {
    code:'ROGUE', name:'ছিঁচকে চোর', en:'Pickpocket', rank:0, qty:2,
    img:`${ILL}/rouge.png`,
    text:'রাউন্ডের শেষে যদি আপনি একমাত্র খেলোয়াড় হন যে ছিঁচকে চোর কার্ডটি খেলেছে এবং ঐ রাউন্ডের শেষ পর্যন্ত খেলায় আছেন, তাহলে আপনি একটি টোকেন পাবেন।',
  },
};
